"""
2. Деканат.
Дано: n - целое число.
Задание: спроектируйте следующую предметную область, используя объектно-ориентированный подход.
Сотрудники деканата каждый семестр решают проблему формирования отчетных ведомостей студентов,
разных групп и курсов. Цель - получить информацию о среднем балле каждого студента, группы,
а также предмета(например, средний балл по физкультуре в группе 433 составляет 4.1).
Такая информация поможет сформировать список студентов, которых нужно отчислить и стипендиатов,
а также наиболее "проблемные" предметы.
"""

